tutorials/BarschdorffNozzleLUSGS2/constant/twoFluidProperties

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


epsilon         1.0e-20;
epsilonMin      1.0e-20;
epsilonMax      1.0e-18;

drag
{
    type        viscousDrag;
}

condensation
{
    condensationModel   monodispersion;
    nucleationModel     CNTNucleationModel;
    growthModel         gyarmathyGrowthModel;
    saturationCurve     IF97;
    liquidProperties    H2O_IAPWS97reg1;

    surfaceTensionCorrection 1.194;

    Kantrowitz on;
    //Courtney on;
}

// ************************************************************************* //
