tutorials/BarschdorffNozzleLUSGS2/0.orig/T.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 350;

boundaryField
{
    inlet
    {
        type            isentropicTemperature;
        T0.1            uniform 373.1;
        p0              uniform 78390;
        value           uniform 350;
    }
    outlet
    {
        type            zeroGradient;
    }
    
    wall
    {
        type            zeroGradient;
    }

    emptyPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
