tutorials/BarschdorffNozzleLUSGS2/0.orig/alpha
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1e-29;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-29;
    }
    
    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            slip;
    }
    
    emptyPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
