tutorials/BarschdorffNozzleLUSGS2/system/sample
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//


type sets;
libs (“libsampling.so”);

interpolationScheme cellPoint;

setFormat raw;

sets
(
    data
    {
        type uniform;
        axis x;
        start (-0.2 0 0);
        end (0.105 0 0);
        nPoints 240;
    }
);

fields (h.1 s.1);


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//
